using System;

namespace Fifth
{
    class MainClass
    {
        public static void Main(string[] args)
        {
            //Козлов Никита Сергеевич
            //а) Написать программу, которая выводит на экран ваше имя, фамилию и город проживания.
            //б) *Сделать задание, только вывод организовать в центре экрана.
            //в) **Сделать задание б с использованием собственных методов(например, Print(string ms, int x, int y).

                int a = 10;     // Присваиваем начальное значение
                int b = 20;     // Присваиваем начальное значение
                int t = a;        // В t запоминаем значение a
                a = b;           // В a записываем b
                b = t;           // В b записываем сохраненное a
            

        }
    }
}
